# DisciplineTypeId Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisciplineTypeId Class
Members See Also
---
This class contains constants identifying disciplines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static class DisciplineTypeId
```

Visual Basic
---
```text
Public NotInheritable Class DisciplineTypeId
```

Visual C++
---
```text
public ref class DisciplineTypeId abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..DisciplineTypeId
# See Also
DisciplineTypeId Members
Autodesk.Revit.DB Namespace